In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
from sqlalchemy import create_engine

In [3]:
host = r'127.0.0.1'
db = r'MSDS610'
user = r'postgres'
pw = r'MSDS610'
port = r'5432'

In [4]:
db_conn = create_engine("postgresql://{}:{}@{}:{}/{}".format(user, pw, host, port, db))

In [5]:
table_name = r'adult_data'
schema = r'raw' # schema were the data was loaded last week.

df = pd.read_sql_table(table_name, db_conn, schema)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32559 entries, 0 to 32558
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32559 non-null  int64
 1   workclass       32559 non-null  object
 2   fnlwgt          32559 non-null  int64
 3   education       32559 non-null  object
 4   education_num   32559 non-null  int64
 5   marital_status  32559 non-null  object
 6   occupation      32559 non-null  object
 7   relationship    32559 non-null  object
 8   race            32559 non-null  object
 9   sex             32559 non-null  object
 10  capital_gain    32559 non-null  int64
 11  capital_loss    32559 non-null  int64
 12  hours_per_week  32559 non-null  int64
 13  native_country  32559 non-null  object
 14  income          32559 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [7]:
df.describe()

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
count,32559.000000,3.255900e+04,32559.000000,32559.000000,32559.000000,32559.000000
mean,38.581283,1.897851e+05,10.080500,1077.648269,87.309193,40.438312
std,13.640705,1.055497e+05,2.572698,7385.514002,402.972014,12.346871
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178330e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783700e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370580e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [8]:
df.head(10)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
1,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
2,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
3,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
4,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
5,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
6,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
7,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K
8,37,Private,280464,Some-college,10,Married-civ-spouse,Exec-managerial,Husband,Black,Male,0,0,80,United-States,>50K
9,30,State-gov,141297,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,0,0,40,India,>50K

In [9]:
clean_df = df.copy()

In [10]:
missing_values = (clean_df == " ?").sum()
print(missing_values)

age                  0
workclass         1836
fnlwgt               0
education            0
education_num        0
marital_status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital_gain         0
capital_loss         0
hours_per_week       0
native_country     583
income               0
dtype: int64

In [11]:
clean_df.replace(" ?", np.nan, inplace=True)

In [12]:
missing = clean_df.isna().sum()

In [13]:
missing_count = missing.reset_index()
missing_count.columns = ['Feature', 'Missing Values']
print(missing_count)

           Feature  Missing Values
0              age               0
1        workclass            1836
2           fnlwgt               0
3        education               0
4    education_num               0
5   marital_status               0
6       occupation            1843
7     relationship               0
8             race               0
9              sex               0
10    capital_gain               0
11    capital_loss               0
12  hours_per_week               0
13  native_country             583
14          income               0

In [14]:
clean_df = clean_df.dropna(axis=0)

In [15]:
missing = clean_df.isna().sum()
missing_count = missing.reset_index()
missing_count.columns = ['Feature', 'Missing Values']
print(missing_count)

           Feature  Missing Values
0              age               0
1        workclass               0
2           fnlwgt               0
3        education               0
4    education_num               0
5   marital_status               0
6       occupation               0
7     relationship               0
8             race               0
9              sex               0
10    capital_gain               0
11    capital_loss               0
12  hours_per_week               0
13  native_country               0
14          income               0

The rows with the missing values have been removed as they were categorical data.

In [16]:
clean_df.workclass.unique()

array([' Private', ' Self-emp-not-inc', ' State-gov', ' Federal-gov',
       ' Local-gov', ' Self-emp-inc', ' Without-pay'], dtype=object)

In [17]:
clean_df.workclass.replace([' State-gov', ' Federal-gov', ' Local-gov'], 'Government', inplace=True)
clean_df.workclass.unique()

array([' Private', ' Self-emp-not-inc', 'Government', ' Self-emp-inc',
       ' Without-pay'], dtype=object)

In [18]:
clean_df.workclass.replace([' Self-emp-not-inc', ' Self-emp-inc'], 'Self-Employed', inplace=True)
clean_df.workclass.unique()

array([' Private', 'Self-Employed', 'Government', ' Without-pay'],
      dtype=object)

In [19]:
clean_df.education.unique()

array([' HS-grad', ' 11th', ' Bachelors', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' 7th-8th', ' Doctorate',
       ' Assoc-voc', ' Prof-school', ' 5th-6th', ' 10th', ' Preschool',
       ' 12th', ' 1st-4th'], dtype=object)

In [20]:
clean_df.education.replace([' Preschool', ' 1st-4th', ' 5th-6th', ' 7th-8th', ' 9th', ' 10th', ' 11th', ' 12th'], 'School', inplace=True)
clean_df.education.unique()

array([' HS-grad', 'School', ' Bachelors', ' Masters', ' Some-college',
       ' Assoc-acdm', ' Doctorate', ' Assoc-voc', ' Prof-school'],
      dtype=object)

In [21]:
clean_df.education.replace([' Assoc-acdm', ' Assoc-voc',], 'Associate', inplace=True)
clean_df.education.replace([' Masters', ' Prof-school', ''], 'Graduate', inplace=True)
clean_df.education.replace([' Doctorate'], 'PhD', inplace=True)
clean_df.education.replace([' Some-college', ' Bachelors' ], 'Bachelor', inplace=True)

In [22]:
clean_df.education.replace([' HS-grad',], 'Graduate', inplace=True)
clean_df.education.unique()

array(['Graduate', 'School', 'Bachelor', 'Associate', 'PhD'], dtype=object)

In [23]:
clean_df.race.unique()

array([' White', ' Black', ' Asian-Pac-Islander', ' Amer-Indian-Eskimo',
       ' Other'], dtype=object)

In [24]:
clean_df.sex.unique()

array([' Male', ' Female'], dtype=object)

In [25]:
clean_df.relationship.unique()

array([' Not-in-family', ' Husband', ' Wife', ' Own-child', ' Unmarried',
       ' Other-relative'], dtype=object)

In [26]:
clean_df.marital_status.unique()

array([' Divorced', ' Married-civ-spouse', ' Married-spouse-absent',
       ' Never-married', ' Separated', ' Married-AF-spouse', ' Widowed'],
      dtype=object)

In [27]:
clean_df.occupation.unique()
clean_df.occupation.replace([' Handlers-cleaners', ' Farming-fishing', ' Machine-op-inspct', ' Craft-repair', ' Transport-moving'], 'Skilled Trade', inplace=True)

In [28]:
clean_df.occupation.replace([' Prof-specialty', ' Exec-managerial', ' Tech-support', ' Adm-clerical', ], 'Professional Jobs', inplace=True)
clean_df.occupation.replace([' Sales', ' Priv-house-serv'], 'Sales', inplace=True)
clean_df.occupation.replace([' Protective-serv', ' Armed-Forces'], 'Public Safety', inplace=True)

In [29]:
clean_df.occupation.unique()

array(['Skilled Trade', 'Professional Jobs', ' Other-service', 'Sales',
       'Public Safety'], dtype=object)

Feature Engineering

In [30]:
clean_df["education_age_ratio"] = clean_df["education_num"] / clean_df["age"]
clean_df["work_age_ratio"] = (clean_df["hours_per_week"] * 52) / clean_df["age"]

In [31]:
clean_df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,education_age_ratio,work_age_ratio
0,38,Private,215646,Graduate,9,Divorced,Skilled Trade,Not-in-family,White,Male,0,0,40,United-States,<=50K,0.236842,54.736842
1,53,Private,234721,School,7,Married-civ-spouse,Skilled Trade,Husband,Black,Male,0,0,40,United-States,<=50K,0.132075,39.245283
2,28,Private,338409,Bachelor,13,Married-civ-spouse,Professional Jobs,Wife,Black,Female,0,0,40,Cuba,<=50K,0.464286,74.285714
3,37,Private,284582,Graduate,14,Married-civ-spouse,Professional Jobs,Wife,White,Female,0,0,40,United-States,<=50K,0.378378,56.216216
4,49,Private,160187,School,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K,0.102041,16.979592

In [32]:
clean = "cleaned_adult_data.csv"
clean_df.to_csv(clean, index=False)

In [33]:
table_name = r'cleaned_adult_data'
schema = r'cleaned' # schema we created this week.

clean_df.to_sql(table_name, con=db_conn, if_exists='replace', index=False, schema=schema, chunksize=1000, method='multi')

30160